In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-3.0.0-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dc\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dc\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata in c:\users\dc\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\dc\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-3.0.0-cp312-cp312-win_amd64.whl (9.7 MB)
   ---------------------------------------- 0.0/9.7 MB ? eta -:--:--
   ------ --------------------------------- 1.6/9.7 MB 8.4 MB/s eta 0:00:01
   ---------------- ----------------------- 3.9/9.7 MB 10.2 MB/s eta 0:00:01
   ------------------------ --------------- 6.0/9.7 MB 10.3 MB/s eta 0:00:01
   ----------------------------- ---------- 7.1/9.7 MB 8.6 MB/s eta 0:00:01
   ---------------------------------------  9.7/9.7 MB 9.3 MB/s eta 0:00:01
   ---------------------------------------- 9.7/9.7 MB 8.8 MB/s eta 0:00:00
Installing collected packages: pandas
Successfully installed pandas-3.0.0
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import pandas as pd

In [2]:
pd.__version__

'3.0.0'

In [3]:
# 1. Create dataframe
df = pd.DataFrame([11,22,33], columns = ['Col_Name'])
print(df)
print(type(df))

   Col_Name
0        11
1        22
2        33
<class 'pandas.DataFrame'>

In [4]:
data = {
    'Name': ['Gunjan','Vishakha','Lalita','Radha'],
    'Age': [21,22,23,24],
    'Salary': [20000,22000,24000,29000]
}

In [5]:
df = pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age  Salary
0    Gunjan   21   20000
1  Vishakha   22   22000
2    Lalita   23   24000
3     Radha   24   29000
<class 'pandas.DataFrame'>

In [6]:
# 2. Basic Dataframe understanding

In [7]:
df.head(2) # top rows

       Name  Age  Salary
0    Gunjan   21   20000
1  Vishakha   22   22000

In [8]:
df.tail(2) # last rows

     Name  Age  Salary
2  Lalita   23   24000
3   Radha   24   29000

In [9]:
df.shape

(4, 3)

In [10]:
df.columns

Index(['Name', 'Age', 'Salary'], dtype='str')

In [11]:
df.rename(columns = {'Salary':'Monthly_Salary'},inplace = True)

In [12]:
df

       Name  Age  Monthly_Salary
0    Gunjan   21           20000
1  Vishakha   22           22000
2    Lalita   23           24000
3     Radha   24           29000

In [13]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            4 non-null      str
 1   Age             4 non-null      int64
 2   Monthly_Salary  4 non-null      int64
dtypes: int64(2), str(1)
memory usage: 228.0 bytes

In [14]:
df.describe()

             Age  Monthly_Salary
count   4.000000        4.000000
mean   22.500000    23750.000000
std     1.290994     3862.210075
min    21.000000    20000.000000
25%    21.750000    21500.000000
50%    22.500000    23000.000000
75%    23.250000    25250.000000
max    24.000000    29000.000000

In [15]:
# 3. Save and load data from csv

In [16]:
df.to_csv('Test_data.csv',index=False)  # export data frame

In [17]:
load_df = pd.read_csv('Test_data.csv')  # import data frame
print(load_df)

       Name  Age  Monthly_Salary
0    Gunjan   21           20000
1  Vishakha   22           22000
2    Lalita   23           24000
3     Radha   24           29000

In [18]:
# 4. Rows & Columns - selection

In [19]:
# Select column
# df[['Name']] # single column
df[['Name','Monthly_Salary']]

       Name  Monthly_Salary
0    Gunjan           20000
1  Vishakha           22000
2    Lalita           24000
3     Radha           29000

In [20]:
# select rows
# Loc - Lavel based index
# df.loc[df.Name=='Gunjan']
df.loc[(df.Name=='Radha') & (df.Monthly_Salary >= 25000)]

    Name  Age  Monthly_Salary
3  Radha   24           29000

In [21]:
# iloc - index-value based
# df.iloc[3]
df.iloc[0:3]

       Name  Age  Monthly_Salary
0    Gunjan   21           20000
1  Vishakha   22           22000
2    Lalita   23           24000

In [22]:
# Filter dataframe

In [23]:
df

       Name  Age  Monthly_Salary
0    Gunjan   21           20000
1  Vishakha   22           22000
2    Lalita   23           24000
3     Radha   24           29000

In [24]:
df_age_filter = df[df['Age'] >= 23]

In [25]:
df_age_filter

     Name  Age  Monthly_Salary
2  Lalita   23           24000
3   Radha   24           29000

In [26]:
df[(df['Age'] >=23) & (df['Monthly_Salary'] >=24000)]

     Name  Age  Monthly_Salary
2  Lalita   23           24000
3   Radha   24           29000

In [27]:
# Where method
df.where(df['Age'] >= 23,other = 'Not qualified')

            Name            Age Monthly_Salary
0  Not qualified  Not qualified  Not qualified
1  Not qualified  Not qualified  Not qualified
2         Lalita             23          24000
3          Radha             24          29000

In [28]:
# 6. Rows and columns - Operations (Add, Update, Delete)
df

       Name  Age  Monthly_Salary
0    Gunjan   21           20000
1  Vishakha   22           22000
2    Lalita   23           24000
3     Radha   24           29000

In [29]:
# Add new column
df['Team'] = ['CEO','HR','CTO','DA']

In [30]:
df

       Name  Age  Monthly_Salary Team
0    Gunjan   21           20000  CEO
1  Vishakha   22           22000   HR
2    Lalita   23           24000  CTO
3     Radha   24           29000   DA

In [34]:
# Delete a column
df.drop(4,axis=1, inplace=True)

In [35]:
df

       Name  Age  Monthly_Salary Team
0    Gunjan   21           20000  CEO
1  Vishakha   22           22000   HR
2    Lalita   23           24000  CTO
3     Radha   24           29000   DA

In [36]:
df['Bonus'] = df['Monthly_Salary'] * 0.2
df

       Name  Age  Monthly_Salary Team   Bonus
0    Gunjan   21           20000  CEO  4000.0
1  Vishakha   22           22000   HR  4400.0
2    Lalita   23           24000  CTO  4800.0
3     Radha   24           29000   DA  5800.0

In [37]:
# Add new Row
df.loc[len(df)] = ['Laxmi',25,50000,'Tech',2000]
df

       Name  Age  Monthly_Salary  Team   Bonus
0    Gunjan   21           20000   CEO  4000.0
1  Vishakha   22           22000    HR  4400.0
2    Lalita   23           24000   CTO  4800.0
3     Radha   24           29000    DA  5800.0
4     Laxmi   25           50000  Tech  2000.0

In [38]:
len(df)

5

In [39]:
# update a value - using index name 
df.loc[1, 'Name'] = 'Sneha'
df

     Name  Age  Monthly_Salary  Team   Bonus
0  Gunjan   21           20000   CEO  4000.0
1   Sneha   22           22000    HR  4400.0
2  Lalita   23           24000   CTO  4800.0
3   Radha   24           29000    DA  5800.0
4   Laxmi   25           50000  Tech  2000.0

In [40]:
# Update value - using column value
df.loc[df['Name'] == 'Sneha','Salary'] = 30000

In [41]:
df

     Name  Age  Monthly_Salary  Team   Bonus   Salary
0  Gunjan   21           20000   CEO  4000.0      NaN
1   Sneha   22           22000    HR  4400.0  30000.0
2  Lalita   23           24000   CTO  4800.0      NaN
3   Radha   24           29000    DA  5800.0      NaN
4   Laxmi   25           50000  Tech  2000.0      NaN

In [70]:
# Delete a Row
df.drop(index=df.index[df.index == 'Name'], inplace = True)
df.drop(df[df.Name == 'ABC'].index   # axis = 0 
# Delete a column
df.drop(columns = ['Salary'], inplace = True)  # axis = 1

In [42]:
df

     Name  Age  Monthly_Salary  Team   Bonus   Salary
0  Gunjan   21           20000   CEO  4000.0      NaN
1   Sneha   22           22000    HR  4400.0  30000.0
2  Lalita   23           24000   CTO  4800.0      NaN
3   Radha   24           29000    DA  5800.0      NaN
4   Laxmi   25           50000  Tech  2000.0      NaN

In [43]:
df.rename(columns = {'Monthly_Salary': 'Salary'}, inplace = True)

In [45]:
#  sort value
df.sort_values('Salary')   # ascending order,  by default

In [47]:
# descending order
df.sort_values('Salary', ascending = False)

In [54]:
# 7. working with date value

In [48]:
df['DOJ'] = ['2024-01-01', '2024-01-15', '2024-03-28', '2024-03-03','2024-04-22']
df

     Name  Age  Salary  Team   Bonus   Salary         DOJ
0  Gunjan   21   20000   CEO  4000.0      NaN  2024-01-01
1   Sneha   22   22000    HR  4400.0  30000.0  2024-01-15
2  Lalita   23   24000   CTO  4800.0      NaN  2024-03-28
3   Radha   24   29000    DA  5800.0      NaN  2024-03-03
4   Laxmi   25   50000  Tech  2000.0      NaN  2024-04-22

In [49]:
df['DOJ'].dtype

In [50]:
df['DOJ'] = pd.to_datetime(df['DOJ'])

In [51]:
df['DOJ'].dtype

dtype('<M8[us]')

In [52]:
df1 = df

In [53]:
df1['DOJ2'] = ['01-01-2025','15-01-2025','28-03-2024','03-03-2024','22-04-2024']
df1

     Name  Age  Salary  Team   Bonus   Salary        DOJ        DOJ2
0  Gunjan   21   20000   CEO  4000.0      NaN 2024-01-01  01-01-2025
1   Sneha   22   22000    HR  4400.0  30000.0 2024-01-15  15-01-2025
2  Lalita   23   24000   CTO  4800.0      NaN 2024-03-28  28-03-2024
3   Radha   24   29000    DA  5800.0      NaN 2024-03-03  03-03-2024
4   Laxmi   25   50000  Tech  2000.0      NaN 2024-04-22  22-04-2024

In [54]:
df1['DOJ2'].dtype

In [55]:
df1['DOJ2'] = pd.to_datetime(df1['DOJ2'], format = '%d-%m-%Y') 
df1['DOJ2'].dtype

dtype('<M8[us]')

In [56]:
df.drop(columns = ['DOJ2'], inplace = True)

In [57]:
df

     Name  Age  Salary  Team   Bonus   Salary        DOJ
0  Gunjan   21   20000   CEO  4000.0      NaN 2024-01-01
1   Sneha   22   22000    HR  4400.0  30000.0 2024-01-15
2  Lalita   23   24000   CTO  4800.0      NaN 2024-03-28
3   Radha   24   29000    DA  5800.0      NaN 2024-03-03
4   Laxmi   25   50000  Tech  2000.0      NaN 2024-04-22

In [58]:
# extract year, month, week, day
df['DOJ'].dt.year
df['DOJ'].dt.month
df['DOJ'].dt.day
df['DOJ'].dt.day_name()

0      Monday
1      Monday
2    Thursday
3      Sunday
4      Monday
Name: DOJ, dtype: str

In [59]:
df['Month'] = df['DOJ'].dt.month
df

     Name  Age  Salary  Team   Bonus   Salary        DOJ  Month
0  Gunjan   21   20000   CEO  4000.0      NaN 2024-01-01      1
1   Sneha   22   22000    HR  4400.0  30000.0 2024-01-15      1
2  Lalita   23   24000   CTO  4800.0      NaN 2024-03-28      3
3   Radha   24   29000    DA  5800.0      NaN 2024-03-03      3
4   Laxmi   25   50000  Tech  2000.0      NaN 2024-04-22      4

In [60]:
df['DOJ'] + pd.Timedelta(days=90)

0   2024-03-31
1   2024-04-14
2   2024-06-26
3   2024-06-01
4   2024-07-21
Name: DOJ, dtype: datetime64[us]

In [61]:
# 8. Handling missing values

In [62]:
df.isnull()

    Name    Age  Salary   Team  Bonus  Salary    DOJ  Month
0  False  False   False  False  False    True  False  False
1  False  False   False  False  False   False  False  False
2  False  False   False  False  False    True  False  False
3  False  False   False  False  False    True  False  False
4  False  False   False  False  False    True  False  False

In [63]:
import numpy as np

In [64]:
df.loc[df.Name == 'Lalita','Salary'] = np.nan

In [65]:
df

     Name  Age   Salary  Team   Bonus   Salary        DOJ  Month
0  Gunjan   21  20000.0   CEO  4000.0      NaN 2024-01-01      1
1   Sneha   22  22000.0    HR  4400.0  30000.0 2024-01-15      1
2  Lalita   23      NaN   CTO  4800.0      NaN 2024-03-28      3
3   Radha   24  29000.0    DA  5800.0      NaN 2024-03-03      3
4   Laxmi   25  50000.0  Tech  2000.0      NaN 2024-04-22      4

In [66]:
df.isnull()

    Name    Age  Salary   Team  Bonus  Salary    DOJ  Month
0  False  False   False  False  False    True  False  False
1  False  False   False  False  False   False  False  False
2  False  False    True  False  False    True  False  False
3  False  False   False  False  False    True  False  False
4  False  False   False  False  False    True  False  False

In [67]:
df.isnull().sum()

Name      0
Age       0
Salary    1
Team      0
Bonus     0
Salary    4
DOJ       0
Month     0
dtype: int64

In [68]:
df.fillna(0)

     Name  Age   Salary  Team   Bonus   Salary        DOJ  Month
0  Gunjan   21  20000.0   CEO  4000.0      0.0 2024-01-01      1
1   Sneha   22  22000.0    HR  4400.0  30000.0 2024-01-15      1
2  Lalita   23      0.0   CTO  4800.0      0.0 2024-03-28      3
3   Radha   24  29000.0    DA  5800.0      0.0 2024-03-03      3
4   Laxmi   25  50000.0  Tech  2000.0      0.0 2024-04-22      4

In [69]:
# Aggregation and groupby

In [71]:
df['Team'].value_counts()

Team
CEO     1
HR      1
CTO     1
DA      1
Tech    1
Name: count, dtype: int64

In [72]:
df['Month'].value_counts() # frequency of value

Month
1    2
3    2
4    1
Name: count, dtype: int64

In [78]:
df[df['Month']==1].value_counts()

Name    Age  Team  Bonus   DOJ         Month
Gunjan  21   CEO   4000.0  2024-01-01  1        1
Sneha   22   HR    4400.0  2024-01-15  1        1
Name: count, dtype: int64

In [81]:
# df.drop(columns = ['Salary'], inplace = True
df

     Name  Age  Team   Bonus        DOJ  Month
0  Gunjan   21   CEO  4000.0 2024-01-01      1
1   Sneha   22    HR  4400.0 2024-01-15      1
2  Lalita   23   CTO  4800.0 2024-03-28      3
3   Radha   24    DA  5800.0 2024-03-03      3
4   Laxmi   25  Tech  2000.0 2024-04-22      4

In [85]:
df['Salary'] = [20000,30000,26000,29000,32000]
df

     Name  Age  Team   Bonus        DOJ  Month  Salary
0  Gunjan   21   CEO  4000.0 2024-01-01      1   20000
1   Sneha   22    HR  4400.0 2024-01-15      1   30000
2  Lalita   23   CTO  4800.0 2024-03-28      3   26000
3   Radha   24    DA  5800.0 2024-03-03      3   29000
4   Laxmi   25  Tech  2000.0 2024-04-22      4   32000

In [88]:
df.groupby('Month')['Salary'].mean()  # aggregation based on group by

Month
1    25000.0
3    27500.0
4    32000.0
Name: Salary, dtype: float64

In [91]:
df.groupby('Month').agg({'Salary': 'mean', 'Name': 'count'})

        Salary  Name
Month
1      25000.0     2
3      27500.0     2
4      32000.0     1

In [ ]:
# 10. Concatenate and Merge Dataframe

In [92]:
df1 = pd.DataFrame({'ID':[1,2,3],'Name':['A','B','C']})
df1

   ID Name
0   1    A
1   2    B
2   3    C

In [94]:
df2 = pd.DataFrame({'ID':[1,2,2,4],'Score':[88,96,77,79]})
df2

   ID  Score
0   1     88
1   2     96
2   2     77
3   4     79

In [95]:
pd.concat([df1,df2], axis=0)  # vertical/ row level/top on top

   ID Name  Score
0   1    A    NaN
1   2    B    NaN
2   3    C    NaN
0   1  NaN   88.0
1   2  NaN   96.0
2   2  NaN   77.0
3   4  NaN   79.0

In [97]:
pd.concat([df1,df2], axis=1)  # Horizontal/ column level / side on side

    ID Name  ID  Score
0  1.0    A   1     88
1  2.0    B   2     96
2  3.0    C   2     77
3  NaN  NaN   4     79

In [101]:
# Marge = join
pd.merge(df1, df2, how= 'inner', on = 'ID')

   ID Name  Score
0   1    A     88
1   2    B     96
2   2    B     77

In [102]:
pd.merge(df1, df2, how= 'inner', left_on = 'ID', right_on = 'ID')

   ID Name  Score
0   1    A     88
1   2    B     96
2   2    B     77